# Imports

In [1]:
import pandas as pd
import numpy as np
from tabulate import tabulate

pd.set_option('display.float_format', lambda x: '%.3f' % x)

# Carregar os dados do csv

In [2]:
df_raw = pd.read_csv('data/AB_NYC_2019.csv')
df_raw.head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,2539,Clean & quiet apt home by the park,2787,John,Brooklyn,Kensington,40.647,-73.972,Private room,149,1,9,2018-10-19,0.210,6,365
1,2595,Skylit Midtown Castle,2845,Jennifer,Manhattan,Midtown,40.754,-73.984,Entire home/apt,225,1,45,2019-05-21,0.380,2,355
2,3647,THE VILLAGE OF HARLEM....NEW YORK !,4632,Elisabeth,Manhattan,Harlem,40.809,-73.942,Private room,150,3,0,NaN,NaN,1,365
3,3831,Cozy Entire Floor of Brownstone,4869,LisaRoxanne,Brooklyn,Clinton Hill,40.685,-73.960,Entire home/apt,89,1,270,2019-07-05,4.640,1,194
4,5022,Entire Apt: Spacious Studio/Loft by central park,7192,Laura,Manhattan,East Harlem,40.799,-73.944,Entire home/apt,80,10,9,2018-11-19,0.100,1,0

In [60]:
df_raw.isna().sum()

id                                    0
name                                 16
host_id                               0
host_name                            21
neighbourhood_group                   0
neighbourhood                         0
latitude                              0
longitude                             0
room_type                             0
price                                 0
minimum_nights                        0
number_of_reviews                     0
last_review                       10052
reviews_per_month                 10052
calculated_host_listings_count        0
availability_365                      0
dtype: int64

In [4]:
df_raw.dtypes

id                                  int64
name                               object
host_id                             int64
host_name                          object
neighbourhood_group                object
neighbourhood                      object
latitude                          float64
longitude                         float64
room_type                          object
price                               int64
minimum_nights                      int64
number_of_reviews                   int64
last_review                        object
reviews_per_month                 float64
calculated_host_listings_count      int64
availability_365                    int64
dtype: object

In [5]:
df = df_raw.copy()

In [6]:
#df[['id','host_id']].groupby(['host_id','id']).count().sample(20)

df[df['host_id'] == 219517861 ]
#df.head( 20 ).sort_values('calculated_host_listings_count', ascending = True)

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
38293,30181691,Sonder | 180 Water | Incredible 2BR + Rooftop,219517861,Sonder (NYC),Manhattan,Financial District,40.706,-74.006,Entire home/apt,302,29,0,NaN,NaN,327,309
38294,30181945,Sonder | 180 Water | Premier 1BR + Rooftop,219517861,Sonder (NYC),Manhattan,Financial District,40.708,-74.006,Entire home/apt,229,29,1,2019-05-29,0.730,327,219
38588,30347708,Sonder | 180 Water | Charming 1BR + Rooftop,219517861,Sonder (NYC),Manhattan,Financial District,40.707,-74.004,Entire home/apt,232,29,1,2019-05-21,0.600,327,159
39769,30937590,Sonder | The Nash | Artsy 1BR + Rooftop,219517861,Sonder (NYC),Manhattan,Murray Hill,40.748,-73.976,Entire home/apt,262,2,8,2019-06-09,1.860,327,91
39770,30937591,Sonder | The Nash | Lovely Studio + Rooftop,219517861,Sonder (NYC),Manhattan,Murray Hill,40.748,-73.975,Entire home/apt,255,2,14,2019-06-10,2.590,327,81
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
47691,35871510,Sonder | 116 John | Vibrant Studio + Fitness Room,219517861,Sonder (NYC),Manhattan,Financial District,40.708,-74.006,Entire home/apt,135,29,0,NaN,NaN,327,339
47692,35871511,Sonder | 116 John | Vibrant 1BR + Fitness Room,219517861,Sonder (NYC),Manhattan,Financial District,40.707,-74.007,Entire home/apt,165,29,0,NaN,NaN,327,342
47693,35871515,Sonder | 116 John | Stunning 1BR + Rooftop,219517861,Sonder (NYC),Manhattan,Financial District,40.708,-74.007,Entire home/apt,165,29,0,NaN,NaN,327,347
47814,35936418,Sonder | 116 John | Polished Studio + Gym,219517861,Sonder (NYC),Manhattan,Financial District,40.708,-74.005,Entire home/apt,699,29,0,NaN,NaN,327,327
47821,35937891,Sonder | 116 John | Simple Studio + Gym,219517861,Sonder (NYC),Manhattan,Financial District,40.707,-74.006,Entire home/apt,699,29,0,NaN,NaN,327,341

# Problema de Negócio - Respondendo.

In [7]:
df['last_review'] = pd.to_datetime( df['last_review'] )

In [8]:
table_coluns = [[ 'id', 'id do imóvel'],
                ['name', 'Descrição do Imóvel' ],
                ['host_id','Id do proprietário'],
                ['host_name','Nome do Proprietário'],
                ['neighbourhood_group','Região'],
                ['neighbourhood','Bairro'],
                ['latitude','latitute'],
                ['longitude','longitude'],
                ['room_type', "Categoria"],
                ['price','Preço'],
                ['minimum_nights','Mínimo de Locação'],
                ['number_of_reviews','Número de Locação/comentarios'],
                ['last_review','Última Locação'],
                ['reviews_per_month','??'],
                ['calculated_host_listings_count','Pode ser numero de imoveis do host '],
                ['availability_365', 'Disponibilidade']
            ]

print(tabulate(table_coluns))

------------------------------  ----------------------------------
id                              id do imóvel
name                            Descrição do Imóvel
host_id                         Id do proprietário
host_name                       Nome do Proprietário
neighbourhood_group             Região
neighbourhood                   Bairro
latitude                        latitute
longitude                       longitude
room_type                       Categoria
price                           Preço
minimum_nights                  Mínimo de Locação
number_of_reviews               Número de Locação/comentarios
last_review                     Última Locação
reviews_per_month               ??
calculated_host_listings_count  Pode ser numero de imoveis do host
availability_365                Disponibilidade
------------------------------  ----------------------------------

## 1. Qual o `id` do imóvel com o aluguel (diária) mais caro da base de dados?

In [9]:
df[['id','price']].sort_values('price', ascending=False).reset_index(drop=True).loc[0,'id']

7003697

## 2. Qual o `id` do imóvel com o aluguel (diária) mais barato da base de dados?

In [10]:
df[['id','price']].sort_values('price', ascending=True).reset_index(drop=True).loc[0,'id']

20639914

## 3. Qual o `id` do imóvel que foi mais locado da base de dados?

In [11]:
df[['id','number_of_reviews']].sort_values('number_of_reviews', ascending=False ).reset_index( drop=True ).loc[0,'id']

9145202

## 4. Qual o `id` do imóvel que ficou mais tempo com o anúncio disponível, em dias, para locação na base de dados?

In [12]:
df[['id','availability_365']].sort_values('availability_365', ascending=False).reset_index(drop=True).loc[0,['id','availability_365']]

id                  2539
availability_365     365
Name: 0, dtype: int64

## 5. Qual o `id` do imóvel que ficou menos tempo com o anúncio disponível, em dias, para locação na base de dados?

In [13]:
df[['id','availability_365']].sort_values('availability_365', ascending=True).reset_index(drop=True).loc[0,['id','availability_365']]

id                  19677284
availability_365           0
Name: 0, dtype: int64

## 6. O imóvel com o maior valor de aluguel (diária) da base de dados é o imóvel que possui mais avaliações na base de dados?

In [14]:
df_price_max = df[['id','price']].sort_values('price',ascending=False).reset_index(drop=True).loc[0,'id']
df_aval_max = df[['id','number_of_reviews']].sort_values('number_of_reviews',ascending=False).reset_index(drop=True).loc[0,'id']

print(f'O Imóvel com maior diária é ', df_price_max )
print(f'O Imóvel com melhor avaliação é ', df_aval_max )

O Imóvel com maior diária é  7003697
O Imóvel com melhor avaliação é  9145202

## 7. O imóvel que possui a menor quantidade mínima de diárias para locação é também o imóvel que possui o aluguel mais caro?

In [15]:
df_min_night = df[['id','minimum_nights']].sort_values('minimum_nights',ascending=True).reset_index(drop=True).loc[0,'id']
df_price_max = df[['id','price']].sort_values('price',ascending=False).reset_index(drop=True).loc[0,'id']

print(f'O Imóvel com menor quantidade de diária é ', df_min_night )
print(f'O Imóvel com maior diária é ', df_price_max )

O Imóvel com menor quantidade de diária é  2539
O Imóvel com maior diária é  7003697

## 8. Qual é a média de diárias mínimas para locação de um imóvel?

In [16]:
np.round(df['price'].mean(),2)

152.72

## 9. Qual é o `id` do imóvel com a quantidade mínima de diárias para locação da base de dados?

In [17]:
df[['id','minimum_nights']].sort_values('minimum_nights',ascending=True).reset_index(drop=True)

             id  minimum_nights
0          2539               1
1      12990578               1
2      13001082               1
3      13006002               1
4      13007839               1
...         ...             ...
48890  10053943             999
48891  20990053             999
48892  30378211             999
48893   1615764            1000
48894   4204302            1250

[48895 rows x 2 columns]

## 10.Qual é o `id` do host que possui o imóvel mais alugado na base de dados?

In [18]:
df[['host_id','number_of_reviews']].sort_values('number_of_reviews', ascending=False).reset_index(drop=True)

        host_id  number_of_reviews
0      47621202                629
1       4734398                607
2       4734398                597
3       4734398                594
4      47621202                576
...         ...                ...
48890  14005489                  0
48891  50255130                  0
48892  50252837                  0
48893  50054847                  0
48894  68119814                  0

[48895 rows x 2 columns]

## 11. Qual é o `id` do host que possui o imóvel menos alugado na base de dado

In [19]:
df[['host_id','number_of_reviews']].sort_values('number_of_reviews', ascending=True).reset_index(drop=True)

         host_id  number_of_reviews
0       68119814                  0
1        1819657                  0
2       68585649                  0
3      232169947                  0
4       27894798                  0
...          ...                ...
48890   47621202                576
48891    4734398                594
48892    4734398                597
48893    4734398                607
48894   47621202                629

[48895 rows x 2 columns]

## 12.Qual é o `id` do host que possui o imóvel com mais avaliações na base de dados?

In [20]:
df[['host_id','number_of_reviews']].sort_values('number_of_reviews',ascending=False).reset_index(drop=True)

        host_id  number_of_reviews
0      47621202                629
1       4734398                607
2       4734398                597
3       4734398                594
4      47621202                576
...         ...                ...
48890  14005489                  0
48891  50255130                  0
48892  50252837                  0
48893  50054847                  0
48894  68119814                  0

[48895 rows x 2 columns]

## 13.Qual é o `id` do host que possui a maior quantidade de imóveis cadastrados na base de dados?

In [21]:
df[['id','host_id']].groupby('host_id').count().sort_values('id', ascending=False ).reset_index()

         host_id   id
0      219517861  327
1      107434423  232
2       30283594  121
3      137358866  103
4       16098958   96
...          ...  ...
37452   13540183    1
37453   13538150    1
37454   13535952    1
37455   13533446    1
37456  274321313    1

[37457 rows x 2 columns]

## 14.Qual o `id` do host que possui o imóvel com a última avaliação feita na base de dados?

In [22]:
df[['host_id','last_review']].sort_values('last_review', ascending=False).reset_index(drop=True)

         host_id last_review
0       74162901  2019-07-08
1       42540127  2019-07-08
2      258536261  2019-07-08
3       59642348  2019-07-08
4       85773188  2019-07-08
...          ...         ...
48890    8232441         NaT
48891    6570630         NaT
48892   23492952         NaT
48893   30985759         NaT
48894   68119814         NaT

[48895 rows x 2 columns]

## 15.Qual o `id` do host que possui mais imóveis ativos dentro da base de dados?

In [23]:
df_ativos = df[df['number_of_reviews'] > 0 ]

df_ativos[['host_id','number_of_reviews']].groupby('host_id').sum().sort_values('number_of_reviews', ascending=False ).reset_index()

         host_id  number_of_reviews
0       37312959               2273
1         344035               2205
2       26432133               2017
3       35524316               1971
4       40176101               1818
...          ...                ...
30246   25376759                  1
30247   25394253                  1
30248  170413197                  1
30249   25475028                  1
30250       2438                  1

[30251 rows x 2 columns]

## 16.O host que possui mais imóveis é o host que também possui mais avaliações?

In [24]:
max_host_imovel = df[['host_id','id']].groupby('host_id').sum().sort_values('id',ascending=False).reset_index().loc[0,'host_id']
max_host_aval = df[['host_id','number_of_reviews']].groupby('host_id').sum().sort_values('number_of_reviews',ascending=False).reset_index().loc[0,'host_id']

print( max_host_imovel)
print( max_host_aval )

219517861
37312959

## 17.Qual é a categoria que mais possui imóveis dentro da base de dados?

In [25]:
df[['id','room_type',]].groupby('room_type').count().sort_values('id',ascending= False).reset_index()

         room_type     id
0  Entire home/apt  25409
1     Private room  22326
2      Shared room   1160

## 18.Qual é a categoria que menos possui imóveis dentro da base de dados?

In [26]:
df[['id','room_type',]].groupby('room_type').count().sort_values('id',ascending= True).reset_index()

         room_type     id
0      Shared room   1160
1     Private room  22326
2  Entire home/apt  25409

## 19.A região de Manhattan é a região que mais possui imóveis ativos para locação, da categoria `Private room`?

In [27]:
df_ativos = df[df['number_of_reviews'] > 0 ]
df_ativos[['neighbourhood_group','number_of_reviews']].groupby('neighbourhood_group').sum().sort_values('number_of_reviews', ascending=False).reset_index()

  neighbourhood_group  number_of_reviews
0            Brooklyn             486574
1           Manhattan             454569
2              Queens             156950
3               Bronx              28371
4       Staten Island              11541

## 20.Qual a categoria de imóvel que possui a maior média de tempo de disponibilidade para serem locados da região do `Bronx`? Considere somente imóveis ativos

In [28]:
df_bronx = df.loc[ ( df['number_of_reviews'] > 0 ) & (df['neighbourhood_group'] == 'Bronx')] 
df_bronx[['room_type','minimum_nights']].groupby('room_type').mean()

                 minimum_nights
room_type
Entire home/apt           5.638
Private room              3.078
Shared room               2.093

## 21.Qual a categoria de imóvel ativo que possui o maior valor de aluguel (diária) na região de `Manhattan`?

In [29]:
df_manhattan = df.loc[  ( df['number_of_reviews'] > 0 ) & (df['neighbourhood_group'] == 'Manhattan') ]
df_manhattan[['room_type','price']].groupby('room_type').sum().reset_index()

         room_type    price
0  Entire home/apt  2294312
1     Private room   672560
2      Shared room    27761

## 22.A categoria de imóvel `Private Room` é a categoria que fica mais tempo disponível para locação?

In [30]:
df[['room_type','availability_365']].groupby('room_type').sum().reset_index()

         room_type  availability_365
0  Entire home/apt           2843783
1     Private room           2482739
2      Shared room            187921

## 23.Qual a categoria de imóvel que fica mais tempo disponível, na média, para locação?

In [31]:
df[['room_type','availability_365']].groupby('room_type').mean().sort_values('availability_365',ascending=True).reset_index().loc[0,'room_type']

'Private room'

## 24. A categoria de imóvel que fica menos tempo disponível, na média, para locação é a categoria que possui, em média, o menor aluguel (diária)?

In [32]:
df[['room_type','availability_365','price']].groupby('room_type').mean().reset_index()

         room_type  availability_365   price
0  Entire home/apt           111.920 211.794
1     Private room           111.204  89.781
2      Shared room           162.001  70.128

## 25. A categoria de imóvel `Entire home/apt` é a categoria que possui, na média, o maior valor de aluguel?

In [33]:
df[['room_type','availability_365','price']].groupby('room_type').mean().sort_values('price',ascending=False).reset_index()

         room_type  availability_365   price
0  Entire home/apt           111.920 211.794
1     Private room           111.204  89.781
2      Shared room           162.001  70.128

## 26. A categoria de imóvel `Entire home/apt` é a categoria que possui, na média, menos locações?

In [34]:
df[['room_type','number_of_reviews']].groupby('room_type').mean().sort_values('number_of_reviews',ascending=False).reset_index()

         room_type  number_of_reviews
0     Private room             24.113
1  Entire home/apt             22.842
2      Shared room             16.600

##  27.A categoria de imóvel `Private Room` na região de `Manhattan`, na média, é a categoria que possui o menor valor (diária) de locação, comparado as outras categorias na mesma região?

In [35]:
df_manhattan = df.loc[df['neighbourhood_group'] == 'Manhattan']
df_manhattan[['room_type','price']].groupby('room_type').mean().reset_index()

         room_type   price
0  Entire home/apt 249.239
1     Private room 116.777
2      Shared room  88.977

## 28. Qual a região que possui a maior quantidade de imóveis?

In [36]:
df[['neighbourhood_group','id']].groupby('neighbourhood_group').count().sort_values('id',ascending=False).reset_index()

  neighbourhood_group     id
0           Manhattan  21661
1            Brooklyn  20104
2              Queens   5666
3               Bronx   1091
4       Staten Island    373

## 29. Qual a região que possui a menor quantidade de imóveis?

In [37]:
df[['neighbourhood_group','id']].groupby('neighbourhood_group').count().sort_values('id',ascending=True).reset_index()

  neighbourhood_group     id
0       Staten Island    373
1               Bronx   1091
2              Queens   5666
3            Brooklyn  20104
4           Manhattan  21661

## 30.A região que possui a maior quantidade de imóveis é também a região que possui os imóveis mais locados?

In [38]:
df1 = df[['neighbourhood_group','id']].groupby('neighbourhood_group').count().sort_values('id',ascending=False).reset_index()
df2 = df[['neighbourhood_group','number_of_reviews']].groupby('neighbourhood_group').sum().sort_values('number_of_reviews',ascending=False).reset_index()
df_merge = pd.merge( df1, df2 )
df_merge

  neighbourhood_group     id  number_of_reviews
0           Manhattan  21661             454569
1            Brooklyn  20104             486574
2              Queens   5666             156950
3               Bronx   1091              28371
4       Staten Island    373              11541

## 31.Qual a região que possui a menor quantidade de imóveis locados dentro da base de dados?

In [39]:
df2

  neighbourhood_group  number_of_reviews
0            Brooklyn             486574
1           Manhattan             454569
2              Queens             156950
3               Bronx              28371
4       Staten Island              11541

## 32.A região de `Manhattan` é a região que possui, na média, os maiores aluguéis (diárias) dentro da base de dados?

In [40]:
df[['neighbourhood_group','price']].groupby('neighbourhood_group').mean().sort_values('price',ascending=False).reset_index()

  neighbourhood_group   price
0           Manhattan 196.876
1            Brooklyn 124.383
2       Staten Island 114.812
3              Queens  99.518
4               Bronx  87.497

## 33.A região de `Queens` é a região que possui, na média, os menores aluguéis (diárias) dentro da base de dados?

In [41]:
df[['neighbourhood_group','price']].groupby('neighbourhood_group').mean().sort_values('price',ascending=True).reset_index()

  neighbourhood_group   price
0               Bronx  87.497
1              Queens  99.518
2       Staten Island 114.812
3            Brooklyn 124.383
4           Manhattan 196.876

## 34.Qual a região que possui, na média, os imóveis com os menores aluguéis dentro da base de dados?

In [42]:
df[['neighbourhood_group','price']].groupby('neighbourhood_group').mean().sort_values('price',ascending=True).reset_index()

  neighbourhood_group   price
0               Bronx  87.497
1              Queens  99.518
2       Staten Island 114.812
3            Brooklyn 124.383
4           Manhattan 196.876

## 35.Qual a região que possui os imóveis que ficam, na média, menos tempo disponíveis para aluguel? Ou seja, são alugados mais rápidos na média?

In [43]:
df[['neighbourhood_group','availability_365']].groupby('neighbourhood_group').mean().sort_values('availability_365',ascending=True).reset_index()

  neighbourhood_group  availability_365
0            Brooklyn           100.232
1           Manhattan           111.979
2              Queens           144.452
3               Bronx           165.759
4       Staten Island           199.678

## 36.Qual o bairro possui a maior quantidade de imóveis ativos para locação?

In [44]:
df_bairro = df.loc[ df['number_of_reviews'] > 0 ]
df_bairro[['neighbourhood','number_of_reviews']].groupby('neighbourhood').count().sort_values('number_of_reviews',ascending=False).reset_index()

          neighbourhood  number_of_reviews
0          Williamsburg               3163
1    Bedford-Stuyvesant               3141
2                Harlem               2206
3              Bushwick               1944
4        Hell's Kitchen               1532
..                  ...                ...
213         Castle Hill                  2
214          West Farms                  2
215        Richmondtown                  1
216           Rossville                  1
217         Willowbrook                  1

[218 rows x 2 columns]

## 37.Qual o bairro possui a menor quantidade de imóveis ativos para locação?

In [45]:
df_bairro = df.loc[ (df['number_of_reviews'] > 0) & (df['price'] > 0 )]
df_bairro[['neighbourhood','number_of_reviews']].groupby('neighbourhood').count().sort_values('number_of_reviews',ascending=True).reset_index()

          neighbourhood  number_of_reviews
0           Willowbrook                  1
1          Richmondtown                  1
2             Rossville                  1
3     Castleton Corners                  2
4            West Farms                  2
..                  ...                ...
213      Hell's Kitchen               1532
214            Bushwick               1941
215              Harlem               2206
216  Bedford-Stuyvesant               3137
217        Williamsburg               3162

[218 rows x 2 columns]

## 38.Qual o bairro, e de qual região é esse bairro, que possui o imovel com o maior valor de aluguel?

In [46]:
df_bairro[['neighbourhood','neighbourhood_group','price']].sort_values('price',ascending=False)

         neighbourhood neighbourhood_group  price
9151           Astoria              Queens  10000
17692       Greenpoint            Brooklyn  10000
6530       East Harlem           Manhattan   9999
12342  Lower East Side           Manhattan   9999
30268          Tribeca           Manhattan   8500
...                ...                 ...    ...
22835          Jamaica              Queens     10
22287             SoHo           Manhattan     10
31407         Kips Bay           Manhattan     10
31066  Upper West Side           Manhattan     10
24100   Hell's Kitchen           Manhattan     10

[38833 rows x 3 columns]

## 39.Qual o bairro, e de qual região é esse bairro, que possui o imovel com o menor valor de aluguel?

In [47]:
df_bairro[['neighbourhood','neighbourhood_group','price']].sort_values('price',ascending=True)

         neighbourhood neighbourhood_group  price
32810      Sunset Park            Brooklyn     10
33225          Jamaica              Queens     10
24100   Hell's Kitchen           Manhattan     10
27972       Greenpoint            Brooklyn     10
23256  Upper East Side           Manhattan     10
...                ...                 ...    ...
30268          Tribeca           Manhattan   8500
6530       East Harlem           Manhattan   9999
12342  Lower East Side           Manhattan   9999
9151           Astoria              Queens  10000
17692       Greenpoint            Brooklyn  10000

[38833 rows x 3 columns]

## 40.Qual região que possui o bairro com mais imóveis ativos disponíveis para locação?

In [48]:
df_bairro[['neighbourhood_group','neighbourhood','number_of_reviews']].groupby(['neighbourhood_group','neighbourhood',]).count().sort_values('number_of_reviews',ascending=False)

                                        number_of_reviews
neighbourhood_group neighbourhood
Brooklyn            Williamsburg                     3162
                    Bedford-Stuyvesant               3137
Manhattan           Harlem                           2206
Brooklyn            Bushwick                         1941
Manhattan           Hell's Kitchen                   1532
...                                                   ...
Staten Island       Howland Hook                        2
Queens              Breezy Point                        2
Staten Island       Rossville                           1
                    Richmondtown                        1
                    Willowbrook                         1

[218 rows x 1 columns]

## 41.Qual região que possui o bairro com menos imóveis ativos disponíveis para locação?

In [49]:
df_bairro[['neighbourhood_group','neighbourhood','number_of_reviews']].groupby(['neighbourhood_group','neighbourhood',]).count().sort_values('number_of_reviews',ascending=True)

                                        number_of_reviews
neighbourhood_group neighbourhood
Staten Island       Willowbrook                         1
                    Rossville                           1
                    Richmondtown                        1
                    Westerleigh                         2
                    Eltingville                         2
...                                                   ...
Manhattan           Hell's Kitchen                   1532
Brooklyn            Bushwick                         1941
Manhattan           Harlem                           2206
Brooklyn            Bedford-Stuyvesant               3137
                    Williamsburg                     3162

[218 rows x 1 columns]

## 42.O Bairro `Upper West Side`, na região de `Manhattan`, é o bairro que possui, na média, o maior aluguel dentro da base de dados?

In [50]:
df_manhattan = df.loc[ df['neighbourhood_group'] == 'Manhattan']
df_manhattan[['price','neighbourhood']].groupby('neighbourhood').mean().sort_values('price',ascending=False)

                      price
neighbourhood
Tribeca             490.638
Battery Park City   367.557
Flatiron District   341.925
NoHo                295.718
SoHo                287.103
Midtown             282.719
West Village        267.682
Greenwich Village   263.406
Chelsea             249.739
Theater District    248.014
Nolita              230.138
Financial District  225.491
Gramercy            222.754
Little Italy        222.066
Murray Hill         220.959
Upper West Side     210.918
Hell's Kitchen      204.794
Kips Bay            202.409
Civic Center        191.942
Upper East Side     188.948
Lower East Side     186.313
East Village        186.083
Stuyvesant Town     169.108
Chinatown           161.497
East Harlem         133.199
Two Bridges         127.069
Harlem              118.974
Morningside Heights 114.783
Roosevelt Island    113.260
Washington Heights   89.611
Marble Hill          89.167
Inwood               88.897

## 43.Qual é o bairro que possui, na média, o aluguel mais caro da base de dados?

In [51]:
df[['price','neighbourhood']].groupby('neighbourhood').mean().sort_values('price',ascending=False)

                 price
neighbourhood
Fort Wadsworth 800.000
Woodrow        700.000
Tribeca        490.638
Sea Gate       487.857
Riverdale      442.091
...                ...
New Dorp        57.000
Soundview       53.467
Tremont         51.545
Hunts Point     50.500
Bull's Head     47.333

[221 rows x 1 columns]

## 44.Qual o melhor bairro para se adquirir um imóvel, visando o maior valor de aluguel, quantidade de revisões feitas ao longo do tempo e quantidade de revisões mensais? Utilize a seguinte fórmula para verificar qual o melhor imóvel:

𝑟𝑒𝑛𝑡𝑎𝑏𝑖𝑙𝑖𝑑𝑎𝑑𝑒 = ( 𝑝𝑟𝑖𝑐𝑒 * (𝑚𝑖𝑛𝑖𝑚𝑢𝑚_𝑛𝑖𝑔ℎ𝑡𝑠 + 1) * 𝑛𝑢𝑚𝑏𝑒𝑟_𝑜𝑓_𝑟𝑒𝑣𝑖𝑒𝑤𝑠 ) / 𝑎𝑣𝑎𝑖𝑙𝑎𝑏𝑖𝑙𝑖𝑡𝑦_365

In [52]:
df_novo = df.loc[ (df['number_of_reviews'] > 0)  & (df['price'] > 0) & (df['availability_365'] > 0)]
df_novo['rentabilidade'] = ( df_novo['price'] * (( df_novo['minimum_nights'] + 1 ) * df_novo['number_of_reviews'] )) / np.sqrt(df_novo['availability_365'])
df_novo.sort_values('rentabilidade',ascending=False).reset_index().head()

/tmp/ipykernel_3968/1393305282.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_novo['rentabilidade'] = ( df_novo['price'] * (( df_novo['minimum_nights'] + 1 ) * df_novo['number_of_reviews'] )) / np.sqrt(df_novo['availability_365'])

,index,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,rentabilidade
0,3605,2154075,"Brooklyn Charm, Close to Manhattan (30+ Days O...",10992588,Joni,Brooklyn,Bedford-Stuyvesant,40.686,-73.945,Entire home/apt,112,200,314,2019-06-20,4.820,2,42,1090734.583
1,6375,4644632,"Brooklyn Life, Easy to Manhattan (30+ Days only)",10992588,Joni,Brooklyn,Bedford-Stuyvesant,40.688,-73.947,Entire home/apt,130,200,271,2019-07-03,4.840,2,64,885153.750
2,12342,9528920,"Quiet, Clean, Lit @ LES & Chinatown",3906464,Amy,Manhattan,Lower East Side,40.714,-73.985,Private room,9999,99,6,2016-01-01,0.140,1,83,658519.701
3,9422,7225366,"Spacious, Modern Times Square 3Bdrm *****",9288577,Tina,Manhattan,Chelsea,40.749,-73.994,Entire home/apt,450,4,206,2019-07-03,4.240,1,1,463500.000
4,5499,3979611,Located at the heart of Manhattan,19407840,Peng,Manhattan,Roosevelt Island,40.756,-73.955,Entire home/apt,1400,90,31,2015-12-03,0.530,1,88,421007.455

## 45.Qual a região em que fica o melhor bairro para se adquirir um imóvel, visando a melhor rentabilidade média? Utilize como métrica o índice criado na questão anterior.

In [53]:
df_novo[['rentabilidade','neighbourhood_group','neighbourhood']].groupby(['neighbourhood_group','neighbourhood']).mean().sort_values('rentabilidade',ascending=False)

                                       rentabilidade
neighbourhood_group neighbourhood
Manhattan           Roosevelt Island       14897.288
                    Nolita                  7499.069
                    Tribeca                 7120.670
                    Greenwich Village       6139.157
                    Chelsea                 6064.488
...                                              ...
Staten Island       Port Richmond            142.423
Queens              Breezy Point              87.051
Bronx               West Farms                73.942
Queens              Little Neck               56.393
Staten Island       Oakwood                   32.544

[217 rows x 1 columns]

## 46.Qual a região em que fica o pior bairro para se adquirir um imóvel, visando a melhor rentabilidade média?  Utilize como métrica o índice criado na questão 44.

In [54]:
df_novo[['rentabilidade','neighbourhood_group','neighbourhood']].groupby(['neighbourhood_group','neighbourhood']).mean().sort_values('rentabilidade',ascending=True)

                                       rentabilidade
neighbourhood_group neighbourhood
Staten Island       Oakwood                   32.544
Queens              Little Neck               56.393
Bronx               West Farms                73.942
Queens              Breezy Point              87.051
Staten Island       Port Richmond            142.423
...                                              ...
Manhattan           Chelsea                 6064.488
                    Greenwich Village       6139.157
                    Tribeca                 7120.670
                    Nolita                  7499.069
                    Roosevelt Island       14897.288

[217 rows x 1 columns]

## 47.Levando em conta o bairro encontrado na questão anterior, verifique qual é o `id` do imóvel ativo que possui a pior rentabilidade desse bairro

In [55]:
df_novo.loc[ (df_novo['neighbourhood_group'] == 'Staten Island' ) & ( df_novo['neighbourhood'] == 'Oakwood' )].sort_values( 'rentabilidade',ascending=True).reset_index()

,index,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,rentabilidade
0,44777,34396747,Double Room,95570540,Eileen,Staten Island,Oakwood,40.559,-74.120,Private room,65,1,1,2019-06-14,1.000,3,364,6.814
1,44583,34312163,Queen Room,95570540,Eileen,Staten Island,Oakwood,40.560,-74.120,Private room,65,1,1,2019-06-28,1.000,3,179,9.717
2,44703,34368051,Home Away from Home,95570540,Eileen,Staten Island,Oakwood,40.561,-74.120,Entire home/apt,130,1,1,2019-06-26,1.000,3,363,13.646
3,19899,15949915,"Quiet, Private 3.5 rooms, Manhattan convenient",103545877,Jon,Staten Island,Oakwood,40.562,-74.127,Entire home/apt,100,2,2,2017-01-30,0.060,1,36,100.000

## 48.Levando em conta o bairro encontrado na questão 45, verifique qual o id do imóvel ativo que possui a melhor rentabilidade desse bairro

In [56]:
df_novo.loc[ df_novo['neighbourhood'] == 'Roosevelt Island' ].sort_values( 'rentabilidade' , ascending=False ).reset_index().head()

,index,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,rentabilidade
0,5499,3979611,Located at the heart of Manhattan,19407840,Peng,Manhattan,Roosevelt Island,40.756,-73.955,Entire home/apt,1400,90,31,2015-12-03,0.530,1,88,421007.455
1,2617,1367775,Furnished room with private bathroom,7419960,Marilyn,Manhattan,Roosevelt Island,40.762,-73.950,Private room,54,30,5,2018-08-18,0.150,1,2,5918.484
2,31368,24374428,Quiet two BEDROOM APT in MANHATTAN UPPER EAST ...,183950956,Dante,Manhattan,Roosevelt Island,40.759,-73.951,Entire home/apt,220,1,76,2019-06-24,5.300,1,60,4317.085
3,28055,21913309,One nice room on the Roosevelt Island; 罗岛一间卧室出租,159884558,Lily,Manhattan,Roosevelt Island,40.762,-73.949,Private room,45,25,37,2018-07-01,1.890,1,149,3546.455
4,9285,7093920,Roosevelt Island Charm,37181980,Svetlana,Manhattan,Roosevelt Island,40.762,-73.949,Private room,83,2,178,2019-07-05,3.720,1,255,2775.551

## 49.Caso eu, investidor, compre o imóvel da questão anterior com um investimento de 1.000.000,00, quantas vezes eu teria que locá-lo para ter o retorno do investimento feito? Utilize a fórmula abaixo para calcular o tempo de retorno do investimento 

𝑟𝑒𝑡𝑢𝑟𝑛_𝑖𝑛𝑣𝑒𝑠𝑡𝑚𝑒𝑛𝑡 =          𝑖𝑛𝑣𝑒𝑠𝑡𝑚𝑒𝑛𝑡  /  𝑝𝑟𝑖𝑐𝑒 * (𝑚𝑖𝑛𝑖𝑚𝑢𝑚_𝑛𝑖𝑔ℎ𝑡𝑠 + 1)

In [57]:
df_best_invest = df_novo.loc[df_novo['id']  == 3979611 ]
return_investiment = 1000000.00 / ( df_best_invest['price'] * ( df_best_invest['minimum_nights'] + 1))
print( np.round( return_investiment, 2 ) )

5499   7.850
dtype: float64

In [58]:
df_best_invest

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,rentabilidade
5499,3979611,Located at the heart of Manhattan,19407840,Peng,Manhattan,Roosevelt Island,40.756,-73.955,Entire home/apt,1400,90,31,2015-12-03,0.530,1,88,421007.455

## 50. Se eu desejasse comprar um imóvel que esteja ativo em um dos bairros abaixo, qual seria o `id` do imóvel com a melhor rentabilidade dentre esses bairros? Utilize o índice calculado na questão 44.

In [59]:
df1 = df_novo.loc[ df_novo['neighbourhood'] == 'East Harlem' ].max()
df2 = df_novo.loc[ df_novo['neighbourhood'] == 'Harlem' ].max()
df3 = df_novo.loc[ df_novo['neighbourhood'] == 'Midtown' ].max()
df4 = df_novo.loc[ df_novo['neighbourhood'] == 'Morningside Heights' ].max()
df5 = df_novo.loc[ df_novo['neighbourhood'] == 'Upper West Side' ].max()
df6 = df_novo.loc[ df_novo['neighbourhood'] == 'Upper East Side' ].max()

df_result = pd.concat([df1, df2, df3, df4, df5, df6], axis=1 ).T

df_result

/tmp/ipykernel_3968/4222319957.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df2 = df_novo.loc[ df_novo['neighbourhood'] == 'Harlem' ].max()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,rentabilidade
0,36205674,"★ UES | Cozy bedroom near LGA, free coffee & tea!",271432195,Zoila,Manhattan,East Harlem,40.817,-73.931,Shared room,1500,32,325,2019-07-07,8.060,103,365,90254.919
1,36235154,⭐️Harlem getaway w/ great amenities,271029539,NaN,Manhattan,Harlem,40.834,-73.935,Shared room,5000,999,607,2019-07-08,9.290,103,365,194435.504
2,36318560,➖PRIVATE ROOFTOP ➖ LUXURY LIVING IN NEW YORK C...,269585762,Zoie + Chris,Manhattan,Midtown,40.768,-73.961,Shared room,5100,365,275,2019-07-07,11.140,232,365,310182.009
3,35645630,哥伦比亚大学附近步行3分钟高档公寓主卧暑期降价转租,264495166,Wenfei,Manhattan,Morningside Heights,40.817,-73.955,Private room,450,31,233,2019-07-07,10.000,12,365,24793.522
4,36351128,曼哈顿108街转租!,273361532,思铨,Manhattan,Upper West Side,40.804,-73.959,Shared room,6000,300,401,2019-07-07,13.130,232,365,191731.297
5,36425863,안전하고 조용한 숙소,271391063,Zs,Manhattan,Upper East Side,40.788,-73.942,Shared room,2300,365,389,2019-07-07,11.250,327,365,239673.705